<policy>
    <general>
        <!-- Enable ID or Name for a Site-based Policy
        <site>
            <id>%SITE_ID%</id>
            <name>%SITE_NAME%</name>
        </site> -->
        <name>Update %PROD_NAME%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <!--Scope added by JSSImporter-->
    </scope>
    <package_configuration>
        <!--Package added by JSSImporter-->
    </package_configuration>
    <scripts>
        <!--Scripts added by JSSImporter-->
    </scripts>
    <self_service>
        <!--Icons added by JSSImporter-->
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>Install %VERSION%</install_button_text>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
        <self_service_categories>
          <category>
            <id>5</id>
            <name>All</name>
            <display_in>true</display_in>
            <feature_in>false</feature_in>
          </category>
        </self_service_categories>
    </self_service>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
