<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of 1Password and builds a package. Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.kitzy.jss-autoupdate.1Password</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Security</string>
		<key>GROUP_NAME</key>
		<string>1Password - Update</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate-updates.xml</string>
		<key>MAJOR_VERSION</key>
		<string>5</string>
		<key>NAME</key>
		<string>1Password</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.11.x,10.10.x</string>
		<key>POLICY_CATEGORY</key>
		<string>Security</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate-autoupdate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>1Password for Mac lets you keep all of your log-ins in one place, so you'll never have to worry about forgetting passwords again. And all of the information you enter into this app is protected by a master password, which means you won't have to worry about unauthorized access, either.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>1Password.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.kitzy.pkg.1Password</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
